ДомПласт_локальная_база/src/InformationRegisters/КоэффициентыСтавкиРефинансированияНБДляРасчетаПени/КоэффициентыСтавкиРефинансированияНБДляРасчетаПени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КоэффициентыСтавкиРефинансированияНБДляРасчетаПени</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНалога</name>
    <comment>Вид налога/сбора/отчисления</comment>
    <type>
      <types>CatalogRef.НалогиСборыОтчисления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДомПласт_локальная_база/src/Catalogs/НалогиСборыОтчисления/НалогиСборыОтчисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалогиСборыОтчисления</name>
  <predefined>
    <items>
      <name>Акциз</name>
      <description>Акциз</description>
    </items>
    <items>
      <name>ВзносыОбязательноеСоциальноеМедицинскоеСтрахование</name>
      <description>Взносы на обязательное социальное медицинское страхование</description>
    </items>
    <items>
      <name>ИндивидуальныйПодоходныйНалог</name>
      <description>Индивидуальный подоходный налог</description>
    </items>
    <items>
      <name>ИндивидуальныйПодоходныйНалогИностранныеГраждане</name>
      <description>Индивидуальный подоходный налог за иностранных граждан</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимость</name>
      <description>Налог на добавленную стоимость</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьСИзмененнымСрокомУплаты</name>
      <description>Налог на добавленную стоимость с измененным сроком уплаты</description>
    </items>
    <items>
      <name>НалогНаИмущество</name>
      <description>Налог на имущество</description>
    </items>
    <items>
      <name>НалогНаПрибыль</name>
      <description>Налог на прибыль (корпоративный подоходный налог)</description>
    </items>
    <items>
      <name>НалогНаТранспорт</name>
      <description>Налог на транспорт</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьЗаНерезидента</name>
      <description>НДС за нерезидента</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьИмпортРБ</name>
      <description>НДС на товары таможенного союза, ввозимые с территории РБ</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьИмпортРФ</name>
      <description>НДС на товары таможенного союза, ввозимые с территории РФ</description>
    </items>
    <items>
      <name>ОбязательныеПенсионныеВзносы</name>
      <description>Обязательные пенсионные взносы</description>
    </items>
    <items>
      <name>ОбязательныеПрофессиональныеПенсионныеВзносы</name>
      <description>Обязательные профессиональные пенсионные взносы</description>
    </items>
    <items>
      <name>ОбязательныеСоциальныеОтчисления</name>
      <description>Обязательные социальные отчисления</description>
    </items>
    <items>
      <name>ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование</name>
      <description>Отчисления на обязательное социальное медицинское страхование</description>
    </items>
    <items>
      <name>СоциальныйНалог</name>
      <description>Социальный налог</description>
    </items>
    <items>
      <name>СоциальныйНалогИнвалиды</name>
      <description>Социальный налог за инвалидов</description>
    </items>
    <items>
      <name>СоциальныйНалогИностранныеСпециалисты</name>
      <description>Социальный налог за иностранных специалистов</description>
    </items>
  </predefined>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНазначенияПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентомБУ</name>
    <type>
      <types>ChartOfAccountsRef.Типовой</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентомНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтноситьНаВычетыВПределахУплаченнойСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ДомПласт_локальная_база/src/InformationRegisters/КоэффициентыСтавкиРефинансированияНБДляРасчетаПени/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьКоэффициентыДляОСМС() Экспорт
	
	НаборЗаписей = РегистрыСведений.КоэффициентыСтавкиРефинансированияНБДляРасчетаПени.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Использование = Истина;
	НаборЗаписей.Отбор.Организация.ВидСравнения	 = ВидСравнения.Равно;
	НаборЗаписей.Отбор.Организация.Значение	 	 = Справочники.Организации.ПустаяСсылка();
	
	// Взносы ОСМС
	НаборЗаписей.Отбор.ВидНалога.Использование = Истина;
	НаборЗаписей.Отбор.ВидНалога.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ВидНалога.Значение	   = Справочники.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование;

	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = '20170701';
	НоваяЗапись.ВидНалога = Справочники.НалогиСборыОтчисления.ВзносыОбязательноеСоциальноеМедицинскоеСтрахование;
	НоваяЗапись.Коэффициент = 2.5;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	// Отчисления ОСМС
	НаборЗаписей.Отбор.ВидНалога.Использование = Истина;
	НаборЗаписей.Отбор.ВидНалога.ВидСравнения  = ВидСравнения.Равно;
	НаборЗаписей.Отбор.ВидНалога.Значение	   = Справочники.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = '20170701';
	НоваяЗапись.ВидНалога = Справочники.НалогиСборыОтчисления.ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование;
	НоваяЗапись.Коэффициент = 2.5;
	
	Попытка
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Записать();
		НаборЗаписей.Очистить();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий
//Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли
